uTasker/uTasker-Kinetis/Applications/uTaskerSerialBoot/app_hw_stm32.h
// Serial interfaces
//
#if defined SERIAL_INTERFACE
    #define NUMBER_EXTERNAL_SERIAL 0
    #define NUMBER_SERIAL  CHIP_HAS_UARTS                                // the number of physical queue needed for serial interface(s)
    #define SIM_COM_EXTENDED                                             // COM ports defined from 1..255
    #define SERIAL_PORT_0  9                                             // if we open UART channel 0 we simulate using this com port on the PC (0 for no mapping)
    #define SERIAL_PORT_1  9                                             // if we open UART channel 1 we simulate using this com port on the PC
    #define SERIAL_PORT_2  0                                             // if we open UART channel 2 we simulate using this com port on the PC
    #define SERIAL_PORT_3  9                                             // if we open UART channel 3 we simulate using this com port on the PC
    #define SERIAL_PORT_4  0                                             // if we open UART channel 4 we simulate using this com port on the PC
    #define SERIAL_PORT_5  9                                             // if we open UART channel 5 we simulate using this com port on the PC

  //#define SERIAL_SUPPORT_DMA                                           // enable UART DMA support
  //#define SUPPORT_HW_FLOW                                              // enable hardware flow control support

    #if defined ST_MB913C_DISCOVERY || defined ARDUINO_BLUE_PILL
        #define LOADER_UART    (STM32_UART_3)                            // use UART channel 2 (USART 3 since ST USARTs count from 1)
    #elif defined STM3240G_EVAL || defined STM32_P207 || defined STM32F407ZG_SK
        #define LOADER_UART    2                                         // use UART channel 2 (USART 3 since ST USARTs count from 1) - the board can't use USART 4 and SD card at the same time so needs a modification for this
      //#define LOADER_UART    3                                         // use UART channel 3 (USART 4 since ST USARTs count from 1)
    #elif defined ST_MB997A_DISCOVERY && defined EMBEST_BASE_BOARD       // {6}
        #define LOADER_UART    5                                         // use UART channel 5 (USART 6 since ST USARTs count from 1)
    #else
        #define LOADER_UART    1                                         // use UART channel 1 (USART 2 since ST USARTs count from 1)
    #endif

    #define TX_BUFFER_SIZE   (256)                                       // the size of RS232 input and output buffers
    #define RX_BUFFER_SIZE   (512)

  //#define USART1_REMAP                                                 // use USART1 on remapped pins (note that this is channel 0)
    #define USART2_REMAP                                                 // use USART2 on remapped pins (note that this is channel 1)
    #if defined STM32_P207 || defined STM32F407ZG_SK
        #define USART3_FULL_REMAP                                        // use USART3 on second set of remapped pins (note that this is channel 2)
    #elif !defined STM3240G_EVAL && !defined ARDUINO_BLUE_PILL
        #define USART3_PARTIAL_REMAP                                     // use USART3 on first set of remapped pins (note that this is channel 2)
    #endif
  //#define USART3_FULL_REMAP                                            // use USART3 on second set of remapped pins (note that this is channel 2)
  //#define USART6_REMAP                                                 // use USART6 on remapped pins (note that this is channel 5)

  //#define UART_RX_INPUT_TYPE  INPUT_PULL_UP                            // {8} enable pull-ups on UART Rx inputs
  //#define UART_CTS_INPUT_TYPE INPUT_PULL_UP                            // {8} enable pull-ups on UART CTS inputs
#else
    #define TX_BUFFER_SIZE   (256)
    #define RX_BUFFER_SIZE   (256)
#endif


#if defined STM3240G_EVAL
    #define USER_KEY_BUTTON            PORTG_BIT15
    #define WAKEUP_BUTTON              PORTA_BIT0
    #define TAMPER_BUTTON              PORTC_BIT13
    #define LED1                       PORTG_BIT6
    #define LED2                       PORTG_BIT8
    #define LED3                       PORTI_BIT9
    #define LED4                       PORTC_BIT7

    #define BLINK_LED                  LED1

    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(G, (USER_KEY_BUTTON), (INPUT_PULL_UP)); _CONFIG_PORT_INPUT(A, (WAKEUP_BUTTON), (INPUT_PULL_UP)) // PG15 and PA0 configured as inputs with pull-ups
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(G, (USER_KEY_BUTTON)) == 0) // disable watchdog by holding the user button down at reset
    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(G, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(G, BLINK_LED)        // blink the LED, if set as output
    #define FORCE_BOOT()               (_READ_PORT_MASK(A, (WAKEUP_BUTTON))) // hold user key at reset to force boot loader mode
    #define RETAIN_LOADER_MODE()       FORCE_BOOT()                      // force retaining boot loader mode after SD card update

    // Power down the USB controller and disable interrupts before jumping to the application
    //
    #define RESET_PERIPHERALS()        IRQ0_31_CER  = 0xffffffff; \
                                       IRQ32_63_CER = 0xffffffff; \
                                       IRQ64_95_CER = 0xffffffff; \
                                       IRQ0_31_CPR  = 0xffffffff; \
                                       IRQ32_63_CPR = 0xffffffff; \
                                       IRQ64_95_CPR = 0xffffffff; \
                                       POWER_DOWN(AHB2, RCC_AHB2ENR_OTGFSEN); \
                                       POWER_DOWN(APB2, RCC_APB2ENR_SYSCFGEN); \
                                       SDIO_POWER = SDIO_POWER_POWER_OFF;
#elif defined STM32F746G_DISCO
    #define USER_KEY_BUTTON            PORTI_BIT11

