uTasker/uTasker-Kinetis/Applications/uTaskerSerialBoot/app_hw_stm32.h
    #define LED1                       PORTI_BIT1                        // green LED
    #define LED2                       PORTI_BIT2                        // no further LEDs available on the board
    #define LED3                       PORTI_BIT3
    #define LED4                       PORTI_BIT4

    #define BLINK_LED                  LED1

    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(I, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(I, BLINK_LED)        // blink the LED, if set as output

    #define INIT_WATCHDOG_DISABLE()
    #define WATCHDOG_DISABLE()         0

    #define FORCE_BOOT()               (_READ_PORT_MASK(I, (USER_KEY_BUTTON))) // hold user key at reset to force boot loader mode
    #define RETAIN_LOADER_MODE()       FORCE_BOOT()                      // force retaining boot loader mode after SD card update

    // LEDs
    //
                                       // '0'            '1'        input state  center (x,   y)  0 = circle, radius, controlling port, controlling pin
    #define KEYPAD_LED_DEFINITIONS     {RGB(50, 50, 50), RGB(0, 255, 0), 0, {14, 163, 27, 168}, _PORTI, LED1}

    #define BUTTON_KEY_DEFINITIONS     {_PORTI, USER_KEY_BUTTON, {16, 235, 31, 250}}

    #define KEYPAD "../../uTaskerV1.4/Simulator/KeyPads/STM32F746-DISC.bmp"

    // Power down the USB controller and disable interrupts before jumping to the application
    //
    #define RESET_PERIPHERALS()        IRQ0_31_CER  = 0xffffffff; \
                                       IRQ32_63_CER = 0xffffffff; \
                                       IRQ64_95_CER = 0xffffffff; \
                                       IRQ0_31_CPR  = 0xffffffff; \
                                       IRQ32_63_CPR = 0xffffffff; \
                                       IRQ64_95_CPR = 0xffffffff; \
                                       POWER_DOWN(AHB2, RCC_AHB2ENR_OTGFSEN); \
                                       POWER_DOWN(APB2, RCC_APB2ENR_SYSCFGEN); \
                                       SDIO_POWER = SDIO_POWER_POWER_OFF;
#elif defined STM3210C_EVA
    #define USER_KEY_BUTTON            PORTB_BIT9
    #define LED1                       PORTD_BIT7
    #define LED2                       PORTD_BIT13
    #define LED3                       PORTD_BIT3
    #define LED4                       PORTD_BIT4

    #define BLINK_LED                  LED4

    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(B, (USER_KEY_BUTTON), (INPUT_PULL_UP)) // PB9 configured as input with pull-up
    #define WATCHDOG_DISABLE()         (!(_READ_PORT_MASK(B, (USER_KEY_BUTTON)))) // disable watchdog by holding the user button down at reset
    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(D, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(D, BLINK_LED)        // blink the LED, if set as output

    #define RETAIN_LOADER_MODE()       0                                 // force retaining boot loader mode after update
#elif defined ST_MB997A_DISCOVERY || defined STM32F405_BOARD             // F4
    #define USER_KEY_BUTTON            PORTA_BIT0
    #define LED1                       PORTD_BIT12                       // green LED
    #define LED2                       PORTD_BIT13                       // orange LED
    #define LED3                       PORTD_BIT14                       // red LED
    #define LED4                       PORTD_BIT15                       // blue LED

    #if defined FINAL_HW
        #define BLINK_LED              PORTC_BIT4
    #else
        #define BLINK_LED              LED1
    #endif

    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(A, (USER_KEY_BUTTON))) // disable watchdog by holding the user button down at reset
    #if defined FINAL_HW
        #define INIT_WATCHDOG_LED()    _CONFIG_PORT_OUTPUT(C, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
        #define TOGGLE_WATCHDOG_LED()  _TOGGLE_PORT(C, BLINK_LED)        // blink the LED, if set as output
    #else
        #define INIT_WATCHDOG_LED()    _CONFIG_PORT_OUTPUT(D, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
        #define TOGGLE_WATCHDOG_LED()  _TOGGLE_PORT(D, BLINK_LED)        // blink the LED, if set as output
    #endif
    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(A, (USER_KEY_BUTTON), (FLOATING_INPUT)) // PA0 configured as input (pull-down on board)

    #if defined STM32F405_BOARD
        #define FORCE_BOOT()           1                                 // always start in loader mode
    #else
        #define FORCE_BOOT()           (_READ_PORT_MASK(A, (USER_KEY_BUTTON))) // hold user key at reset to force boot loader mode
    #endif

    #define RETAIN_LOADER_MODE()       FORCE_BOOT()                      // force retaining boot loader mode after update

    // Power down the USB controller and disable interrupts before jumping to the application
    //
    #define RESET_PERIPHERALS()        IRQ0_31_CER  = 0xffffffff; \
                                       IRQ32_63_CER = 0xffffffff; \
                                       IRQ64_95_CER = 0xffffffff; \
                                       IRQ0_31_CPR  = 0xffffffff; \
                                       IRQ32_63_CPR = 0xffffffff; \
                                       IRQ64_95_CPR = 0xffffffff; \
                                       POWER_DOWN(AHB2, RCC_AHB2ENR_OTGFSEN); \
                                       POWER_DOWN(APB2, RCC_APB2ENR_SYSCFGEN); \
                                       SDIO_POWER = SDIO_POWER_POWER_OFF;
#elif defined STM32F407ZG_SK                                             // F4
    #define USER_BUTTON                PORTG_BIT6
    #define TAMPER_BUTTON              PORTC_BIT13
    #define WKUP_BUTTON                PORTA_BIT0

    #define LED1                       PORTF_BIT6                        // green LED
    #define LED2                       PORTF_BIT7                        // yellow LED
    #define LED3                       PORTF_BIT8                        // red LED
    #define LED4                       PORTF_BIT9                        // green LED

    #define BLINK_LED                  LED1

    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(F, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(F, BLINK_LED)        // blink the LED, if set as output

