uTasker/uTasker-Kinetis/Applications/uTaskerSerialBoot/app_hw_stm32.h
    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(A, (WKUP_BUTTON), (FLOATING_INPUT)); _CONFIG_PORT_INPUT(G, (USER_BUTTON), (FLOATING_INPUT)) // configure inputs (pull-up on board)
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(A, (WKUP_BUTTON)) == 0) // disable watchdog by holding the user button down at reset


    #define FORCE_BOOT()               (_READ_PORT_MASK(G, (USER_BUTTON)) == 0) // hold user key at reset to force boot loader mode

    #define RETAIN_LOADER_MODE()       FORCE_BOOT()                      // force retaining boot loader mode after update

    // Power down the USB controller and disable interrupts before jumping to the application
    //
    #define RESET_PERIPHERALS()        IRQ0_31_CER  = 0xffffffff; \
                                       IRQ32_63_CER = 0xffffffff; \
                                       IRQ64_95_CER = 0xffffffff; \
                                       IRQ0_31_CPR  = 0xffffffff; \
                                       IRQ32_63_CPR = 0xffffffff; \
                                       IRQ64_95_CPR = 0xffffffff; \
                                       POWER_DOWN(AHB2, RCC_AHB2ENR_OTGFSEN); \
                                       POWER_DOWN(APB2, RCC_APB2ENR_SYSCFGEN); \
                                       SDIO_POWER = SDIO_POWER_POWER_OFF;
#elif defined STM32_P207                                                 // F2
    #define TAMPER_BUTTON              PORTC_BIT13
    #define WKUP_BUTTON                PORTA_BIT0

    #define LED1                       PORTF_BIT6                        // green LED
    #define LED2                       PORTF_BIT7                        // yellow LED
    #define LED3                       PORTF_BIT8                        // red LED
    #define LED4                       PORTF_BIT9                        // green LED

    #define BLINK_LED                  LED1

    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(F, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(F, BLINK_LED)        // blink the LED, if set as output

    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(A, (WKUP_BUTTON), (FLOATING_INPUT)); _CONFIG_PORT_INPUT(C, (TAMPER_BUTTON), (FLOATING_INPUT)); // configure inputs (pull-up on board)
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(A, (WKUP_BUTTON)) == 0) // disable watchdog by holding the user button down at reset


    #define FORCE_BOOT()               (_READ_PORT_MASK(C, (TAMPER_BUTTON)) == 0) // hold user key at reset to force boot loader mode

    #define RETAIN_LOADER_MODE()       FORCE_BOOT()                      // force retaining boot loader mode after update

    // Power down the USB controller and disable interrupts before jumping to the application
    //
    #define RESET_PERIPHERALS()        IRQ0_31_CER  = 0xffffffff; \
                                       IRQ32_63_CER = 0xffffffff; \
                                       IRQ64_95_CER = 0xffffffff; \
                                       IRQ0_31_CPR  = 0xffffffff; \
                                       IRQ32_63_CPR = 0xffffffff; \
                                       IRQ64_95_CPR = 0xffffffff; \
                                       POWER_DOWN(AHB2, RCC_AHB2ENR_OTGFSEN); \
                                       POWER_DOWN(APB2, RCC_APB2ENR_SYSCFGEN); \
                                       SDIO_POWER = SDIO_POWER_POWER_OFF;
#elif defined ARDUINO_BLUE_PILL                                          // STM32F103
    #define BLINK_LED                  PORTC_BIT13                       // green LED

#define INIT_WATCHDOG_DISABLE()        _CONFIG_PORT_INPUT(B, (PORTB_BIT12), (INPUT_PULL_UP)); _CONFIG_PORT_INPUT(B, (PORTB_BIT2), (FLOATING_INPUT)); _CONFIG_DRIVE_PORT_OUTPUT_VALUE(A, (PORTA_BIT11 | PORTA_BIT12), (OUTPUT_SLOW | OUTPUT_PUSH_PULL), 0); // PB2 and PB12 configured as input (PTB2 floating due to HW design)
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(B, (PORTB_BIT12)) == 0) // disable watchdog by pulling pin 20 to ground at reset
    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(C, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(C, BLINK_LED)        // blink the LED, if set as output

    #define FORCE_BOOT()               ((_READ_PORT_MASK(B, (PORTB_BIT2)) != 0) || (SOFTWARE_RESET_DETECTED() && (*(BOOT_MAIL_BOX) == RESET_TO_SERIAL_LOADER))) // set BOOT1 to '1' at reset to force boot loader mode
    #define RETAIN_LOADER_MODE()       0                                 // force retaining boot loader mode after update

                                        // '0'            '1'    input state center (x,   y)   0 = circle, radius, controlling port, controlling pin 
    #define KEYPAD_LED_DEFINITIONS     {RGB(0,255,0),RGB(20,20,20), 1, {650, 215, 666, 244}, _PORTC, BLINK_LED},

    #define KEYPAD "../../uTaskerV1.4/Simulator/KeyPads/BluePill.bmp"

    // Power down the USB controller and disable interrupts before jumping to the application
    //
    #define RESET_PERIPHERALS()        IRQ0_31_CER  = 0xffffffff; \
                                       IRQ32_63_CER = 0xffffffff; \
                                       IRQ64_95_CER = 0xffffffff; \
                                       IRQ0_31_CPR  = 0xffffffff; \
                                       IRQ32_63_CPR = 0xffffffff; \
                                       IRQ64_95_CPR = 0xffffffff;
#elif defined ST_MB913C_DISCOVERY                                        // F1
    #define USER_KEY_BUTTON            PORTA_BIT0
    #define LED3                       PORTC_BIT9                        // green LED
    #define LED4                       PORTC_BIT8                        // blue LED

    #define BLINK_LED                  LED3

    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(A, (USER_KEY_BUTTON), (INPUT_PULL_UP)) // PA0 configured as input with pull-up
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(A, (USER_KEY_BUTTON)) == 0) // disable watchdog by holding the user button down at reset
    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(C, BLINK_LED, (OUTPUT_SLOW | OUTPUT_PUSH_PULL))
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(C, BLINK_LED)        // blink the LED, if set as output

