uTasker/uTasker-Kinetis/Applications/uTaskerSerialBoot/app_hw_stm32.h
    #define FORCE_BOOT()               (_READ_PORT_MASK(A, (USER_KEY_BUTTON))) // hold user key at reset to force boot loader mode
    #define RETAIN_LOADER_MODE()       0                                 // force retaining boot loader mode after update

    // Power down the USB controller and disable interrupts before jumping to the application
    //
    #define RESET_PERIPHERALS()        IRQ0_31_CER  = 0xffffffff; \
                                       IRQ32_63_CER = 0xffffffff; \
                                       IRQ64_95_CER = 0xffffffff; \
                                       IRQ0_31_CPR  = 0xffffffff; \
                                       IRQ32_63_CPR = 0xffffffff; \
                                       IRQ64_95_CPR = 0xffffffff;
#endif

#if defined SDCARD_SUPPORT
    #if defined STM3240G_EVAL || defined ST_MB997A_DISCOVERY || defined STM32F746G_DISCO
        #define SD_CONTROLLER_AVAILABLE                                  // use SDIO rather than SPI (necessary on STM3240G-EVAL board)

        #if defined SD_CONTROLLER_AVAILABLE
            #define RING_POST_DIVIDE 8                                   // control the speed of the SDIO clock (ring clock) [VCC clock / 2..15] when USB is not used - if USB is enabled it will be 48MHz
            #define SET_SD_CS_HIGH()                                     // dummy in SDIO mode
            #define SET_SD_CS_LOW()                                      // dummy in SDIO mode
            #define POWER_UP_SD_CARD()                   SDIO_POWER = SDIO_POWER_POWER_ON; SDIO_CLKCR |= (SDIO_POWER_CLKEN);
            #if ((PLL_VCO_FREQUENCY/PLL_Q_VALUE)/20000000) >= 2
                #define SET_SPI_SD_INTERFACE_FULL_SPEED()    SDIO_CLKCR = (SDIO_POWER_HWFC_EN | SDIO_POWER_POSEDGE | SDIO_POWER_BUS_4BIT | SDIO_POWER_PWRSAV | SDIO_POWER_CLKEN | (((PLL_VCO_FREQUENCY/PLL_Q_VALUE)/20000000) - 2)); // set about 20MHz
            #else
                #define SET_SPI_SD_INTERFACE_FULL_SPEED()    SDIO_CLKCR = (SDIO_POWER_HWFC_EN | SDIO_POWER_POSEDGE | SDIO_POWER_BUS_4BIT | SDIO_POWER_PWRSAV | SDIO_POWER_CLKEN | 0); // set highest possible speed
            #endif
        #else
            // Configure to suit SD card SPI mode at between 100k and 400k
            //
            #define SDCARD_CS                  PORTC_BIT11
            #define SDCARD_MISO                PORTB_BIT4
            #define SDCARD_MOSI                PORTB_BIT5
            #define SDCARD_CLK                 PORTB_BIT3
            #define INITIALISE_SPI_SD_INTERFACE() _CONFIG_PORT_OUTPUT(C, SDCARD_CS, (OUTPUT_FAST | OUTPUT_PUSH_PULL)); _SETBITS(C, SDCARD_CS); \
                    POWER_UP(APB1, RCC_APB1ENR_SPI3EN); \
                    _CONFIG_PERIPHERAL_INPUT(B, (PERIPHERAL_SPI3_I2S3ext), (SDCARD_MISO), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); \
                    _CONFIG_PERIPHERAL_OUTPUT(B, (PERIPHERAL_SPI3_I2S3ext), (SDCARD_CLK | SDCARD_MOSI), (OUTPUT_PUSH_PULL | OUTPUT_MEDIUM)); \
                    RCC_APB1RSTR |= RCC_APB1RSTR_SPI3RST; RCC_APB1RSTR &= ~RCC_APB1RSTR_SPI3RST; \
                    SPI3_CR1 = (SPICR1_BR_PCLK2_DIV128 | SPICR1_MSTR | SPICR1_SSI | SPICR1_CPOL | SPICR1_CPHA | SPICR1_SSM); \
                    SPI3_I2SCFGR = 0; \
                    SPI3_CR1 = (SPICR1_SPE | SPICR1_BR_PCLK2_DIV128 | SPICR1_MSTR | SPICR1_SSI | SPICR1_CPOL | SPICR1_CPHA | SPICR1_SSM);

            #define SHARE_SPI                                            // ensure that LCD operations are terminated to avoid conflicts
            #define POWER_UP_SD_CARD()                                   // apply power to the SD card if appropriate
            #define ENABLE_SPI_SD_OPERATION()
            // Set maximum speed
            //
            #define SET_SPI_SD_INTERFACE_FULL_SPEED() SPI3_CR1 = (SPICR1_SPE | SPICR1_BR_PCLK2_DIV2 | SPICR1_MSTR | SPICR1_SSI | SPICR1_CPOL | SPICR1_CPHA | SPICR1_SSM)
            #if defined _WINDOWS
                #define WRITE_SPI_CMD(byte)      SPI3_DR = (unsigned short)byte; SPI3_DR = _fnSimSD_write((unsigned char)byte)
                #define WAIT_TRANSMISSON_END()   while (!(SPI3_SR & SPISR_TXE)) { SPI3_SR |= SPISR_TXE;} \
                                                 while (SPI3_SR & SPISR_BSY) {SPI3_SR &= ~SPISR_BSY;}
            #else
                #define WRITE_SPI_CMD(byte)      SPI3_DR = (unsigned short)byte
                #define WAIT_TRANSMISSON_END()   while (!(SPI3_SR & SPISR_TXE)) {} \
                                                 while (SPI3_SR & SPISR_BSY)
            #endif
            #define READ_SPI_DATA()              (unsigned char)SPI3_DR

            #define SET_SD_DI_CS_HIGH()           _CONFIG_PORT_OUTPUT(C, SDCARD_MISO, (OUTPUT_FAST | OUTPUT_PUSH_PULL)); _SETBITS(C, SDCARD_MISO); _SETBITS(C, SDCARD_CS)     // force DI and CS lines high ready for the initialisation sequence
            #define SET_SD_CARD_MODE()            _CONFIG_PORT_INPUT(C, (SDCARD_MISO), (INPUT_PULL_UP | PULLUP_BIT11));
            #define SET_SD_CS_LOW()               _CLEARBITS(C, SDCARD_CS) // assert the CS line of the SD card to be read
            #define SET_SD_CS_HIGH()              _SETBITS(C, SDCARD_CS) // negate the CS line of the SD card to be read
        #endif        
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface

        #define GET_SDCARD_WP_STATE() 0                                  // write protection disabled (change to read switch if required)

        #if defined EMBEST_BASE_BOARD && defined ST_MB997A_DISCOVERY
            #define CONFIGURE_SDCARD_DETECT_INPUT() _CONFIG_PORT_INPUT(C, PORTC_BIT10, (INPUT_PULL_UP | PULLUP_BIT10))
            #define SDCARD_DETECTION()               (!_READ_PORT_MASK(C, PORTC_BIT10))
        #else
            #define CONFIGURE_SDCARD_DETECT_INPUT() _CONFIG_PORT_INPUT(H, PORTH_BIT13, (INPUT_PULL_UP | PULLUP_BIT13))
            #define SDCARD_DETECTION()               (!_READ_PORT_MASK(H, PORTH_BIT13))
        #endif
    #elif defined STM3210C_EVAL || defined ST_MB913C_DISCOVERY
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_0             PORTA_BIT4
        #define INITIALISE_SPI_SD_INTERFACE() _CONFIG_PORT_OUTPUT(B, PORTB_BIT2, (OUTPUT_FAST | OUTPUT_PUSH_PULL)); _SETBITS(B, PORTB_BIT2); \
                _CONFIG_PORT_OUTPUT(A, SPI_CS1_0, (OUTPUT_FAST | OUTPUT_PUSH_PULL)); _SETBITS(A, SPI_CS1_0); \
                RCC_APB2ENR |= (RCC_APB2ENR_AFIOEN | RCC_APB2ENR_IOPCEN); AFIO_MAPR |= SPI3_REMAP; RCC_APB1ENR |= (RCC_APB1ENR_SPI3EN); \
                _CONFIG_PORT_OUTPUT(C, (PORTC_BIT10 | PORTC_BIT12), (ALTERNATIVE_FUNCTION | OUTPUT_FAST | OUTPUT_PUSH_PULL)); \
                _CONFIG_PORT_INPUT(C, (PORTC_BIT11), (INPUT_PULL_UP | PULLUP_BIT11)); \
                RCC_APB1RSTR |= RCC_APB1RSTR_SPI3RST; RCC_APB1RSTR &= ~RCC_APB1RSTR_SPI3RST; \
                SPI3_CR1 = (SPICR1_BR_PCLK2_DIV128 | SPICR1_MSTR | SPICR1_SSI | SPICR1_CPOL | SPICR1_CPHA | SPICR1_SSM); \
                SPI3_I2SCFGR = 0; \
                SPI3_CR1 = (SPICR1_SPE | SPICR1_BR_PCLK2_DIV128 | SPICR1_MSTR | SPICR1_SSI | SPICR1_CPOL | SPICR1_CPHA | SPICR1_SSM);

        #define SHARE_SPI                                                // ensure that LCD operations are terminated to avoid conflicts

        #define ENABLE_SPI_SD_OPERATION()
        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED() SPI3_CR1 = (SPICR1_SPE | SPICR1_BR_PCLK2_DIV2 | SPICR1_MSTR | SPICR1_SSI | SPICR1_CPOL | SPICR1_CPHA | SPICR1_SSM)
        #if defined _WINDOWS
            #define WRITE_SPI_CMD(byte)      SPI3_DR = (unsigned short)byte; SPI3_DR = _fnSimSD_write((unsigned char)byte)
            #define WAIT_TRANSMISSON_END()   while (!(SPI3_SR & SPISR_TXE)) { SPI3_SR |= SPISR_TXE;} \
                                             while (SPI3_SR & SPISR_BSY) {SPI3_SR &= ~SPISR_BSY;}
        #else
            #define WRITE_SPI_CMD(byte)      SPI3_DR = (unsigned short)byte
            #define WAIT_TRANSMISSON_END()   while (!(SPI3_SR & SPISR_TXE)) {} \
                                             while (SPI3_SR & SPISR_BSY)
        #endif
        #define READ_SPI_DATA()              (unsigned char)SPI3_DR

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()           _CONFIG_PORT_OUTPUT(C, PORTC_BIT11, (OUTPUT_FAST | OUTPUT_PUSH_PULL)); _SETBITS(C, PORTC_BIT11); _SETBITS(A, SPI_CS1_0)     // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CARD_MODE()            _CONFIG_PORT_INPUT(C, (PORTC_BIT11), (INPUT_PULL_UP | PULLUP_BIT11));
        #define SET_SD_CS_LOW()               _CLEARBITS(A, SPI_CS1_0)   // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()              _SETBITS(A, SPI_CS1_0)     // negate the CS line of the SD card to be read
        #define GET_SDCARD_WP_STATE() 0                                  // write protection disabled (change to read switch if required)

        #define CONFIGURE_SDCARD_DETECT_INPUT() _CONFIG_PORT_INPUT(E, PORTE_BIT0, (INPUT_PULL_UP | PULLUP_BIT0))
        #define SDCARD_DETECTION()            (!_READ_PORT_MASK(E, PORTE_BIT0))
    #endif
#endif

