uTasker/uTasker-Kinetis/Applications/uTaskerSerialBoot/app_hw_stm32.h
#if !defined OWN_SD_CARD_DISPLAY                                         // {3}
    #if defined SERIAL_INTERFACE                                         // when UART interface is available
        #define _DISPLAY_SD_CARD_NOT_PRESENT()    fnDebugMsg("SD-Card not present\r\n")
        #define _DISPLAY_SD_CARD_NOT_FORMATTED()  fnDebugMsg("SD-Card not formatted\r\n")
        #define _DISPLAY_NO_FILE()                fnDebugMsg("No file on card\r\n")
        #define _DISPLAY_SD_CARD_PRESENT()        fnDebugMsg("SD-Card present\r\n")
        #define _DISPLAY_VALID_CONTENT()          fnDebugMsg("File valid\r\n")
        #define _DISPLAY_INVALID_CONTENT()        fnDebugMsg("File invalid\r\n")
        #define _DISPLAY_SW_OK()                  fnDebugMsg("Software OK\r\n")
        #define _DISPLAY_SW_UPDATED()             fnDebugMsg("Software Updated\r\n")
        #define _DISPLAY_ERROR()                  fnDebugMsg("Update failed\r\n")
        #define _DISPLAY_OVERSIZE_CONTENT()       fnDebugMsg("File oversized!\r\n")
    #else
        #define _DISPLAY_SD_CARD_NOT_PRESENT()   
        #define _DISPLAY_SD_CARD_NOT_FORMATTED() 
        #define _DISPLAY_NO_FILE()               
        #define _DISPLAY_SD_CARD_PRESENT()       
        #define _DISPLAY_VALID_CONTENT()         
        #define _DISPLAY_INVALID_CONTENT()       
        #define _DISPLAY_SW_OK()
        #define _DISPLAY_SW_UPDATED()
        #define _DISPLAY_ERROR()
        #define _DISPLAY_OVERSIZE_CONTENT()
    #endif
#endif

// Ethernet PHY (MII mode)
//
#if defined ETH_INTERFACE
    #define IP_RX_CHECKSUM_OFFLOAD                                       // allow the HW to perform IPv4/v6 UDP, TCP and ICMP checksum verification so that no such calculation is required in code
    #define IP_TX_CHECKSUM_OFFLOAD                                       // allow the HW to insert IPv4/v6 header checksum and so the software doesn't need to calculate and insert this
    #define IP_TX_PAYLOAD_CHECKSUM_OFFLOAD                               // allow the HW to insert IPv4/v6 payload checksum and so the software doesn't need to calculate and insert this (overrides IP_TX_CHECKSUM_OFFLOAD)

  //#define _MAGIC_RESET_FRAME        0x1234                             // allow a magic Ethernet reception frame to reset the board to boot loader mode (Ethernet protocol used) followed by three repetitions of the same value (total frame length 61 bytes)

  //#define LAN_REPORT_ACTIVITY                                          // transmissions/receptions and errors are reported to chosen task (for link LED control, etc)
    #if defined LAN_REPORT_ACTIVITY
        #define LNKLED                 LED1
        #define ACTLED                 LED2
        #define SPDLED                 0
        #define DUPLED                 0
        #define COLLED                 0
        #define ACTIVITY_LED_OFF()     _CLEARBITS(D, ACTLED)
        #define ACTIVITY_LED_ON()      _SETBITS(D, ACTLED)
        #define TURN_LINK_LED_ON()     _SETBITS(D, LNKLED)
        #define SPEED_LED_ON()         _SETBITS(D, (SPDLED | LNKLED))
        #define SPEED_LED_OFF()        _CLEARBITS(D, (SPDLED | LNKLED))
        #define LINK_DOWN_LEDS()       _CLEARBITS(D, (LNKLED | ACTLED | COLLED | SPDLED | DUPLED))

        #define CONFIGURE_LAN_LEDS()   _CONFIG_DRIVE_PORT_OUTPUT_VALUE(D, (LNKLED | ACTLED | COLLED | SPDLED | DUPLED), (OUTPUT_SLOW | OUTPUT_PUSH_PULL),  0)
    #endif

    #define NUMBER_OF_TX_BUFFERS_IN_ETHERNET_DEVICE 4
    #define NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE 6

    #define LAN_BUFFER_SIZE           1536                               // STM32 has ample space for full tx buffer
    #define HTTP_BUFFER_LENGTH        1400                               // we send frames with this maximum amount of payload data

    #if defined STM3240G_EVAL
        #define _DP83848
        #define PHY_ADDRESS_           0x01                              // address of PHY on STM3210C_EVAL board (MII mode)
        #define VNDR_MDL               0x09                              // vendor model number
        #define MDL_REV                0x00                              // model revision number
        #define PHY_IDENTIFIER         (0x20005c00 | (VNDR_MDL << 4) | MDL_REV) // NATIONAL DP83848 identifier
        #define PHY_INTERRUPT                                            // use PHY interrupt
        #define PHY_INT_PORT           PORT_B
        #define PHY_INT_PIN            14
        #define PHY_INT_PIN_STATE()    _READ_PORT_MASK(B, PORTB_BIT14)
        #define SUPPORT_PORT_INTERRUPTS                                  // support code for port interrupts due to the PHY interrupt
    #elif defined ST_MB997A_DISCOVERY && defined EMBEST_BASE_BOARD
        #define _LAN8720
        #define PHY_ADDRESS_           0x00                              // address of PHY on DiscoverMo board (RMII mode)
        #define VNDR_MDL               0x0f                              // vendor model number
        #define MDL_REV                0x00                              // model revision number
        #define PHY_IDENTIFIER         (0x0007c000 | (VNDR_MDL << 4) | MDL_REV) // SMSC identifier
        #define ETHERNET_RMII                                            // use RMII Ethernet interface instead of MII
        #define RESET_PHY                                                // use a port output to control the reset input of the phy
        #define ASSERT_PHY_RST()       _CONFIG_DRIVE_PORT_OUTPUT_VALUE(E, PORTE_BIT2, (OUTPUT_SLOW | OUTPUT_PUSH_PULL), 0) // assert reset line to phy
        #define CONFIG_PHY_STRAPS()                                      // dummy
        #define NEGATE_PHY_RST()       _SETBITS(E, PORTE_BIT2)           // negate reset line to phy
      //#define PHY_INTERRUPT                                            // no PHY interrupt is connected
        #define PHY_POLL_LINK                                            // activate polling of the link state
      //#define INTERRUPT_TASK_PHY     TASK_NETWORK_INDICATOR            // link status reported to this task (do not use together with LAN_REPORT_ACTIVITY)
    #elif defined STM32F407ZG_SK
        #define ETHERNET_RMII                                            // use RMII Ethernet interface instead of MII
        #define _ST802RT1B                                               // ST802RT1B PHY used on the board
        #define PHY_ADDRESS_           (0x01)                            // address of PHY on board
        #define PHY_IDENTIFIER         0x02038461                        // ST802RT1B identifier
        #define ETH_TXD_G                                                // locate TXD0 and TXD1 on port G rather than port B
        #define PHY_INTERRUPT                                            // use PHY interrupt
        #define SUPPORT_PORT_INTERRUPTS                                  // support code for port interrupts due to the PHY interrupt
        #define PHY_INT_PORT           PORT_A                            // interrupt on PA3
        #define PHY_INT_PIN            3
        #define PHY_INT_PIN_STATE()    _READ_PORT_MASK(A, PORTA_BIT3)
    #elif defined STM32_P207
        #define ETHERNET_RMII                                            // use RMII Ethernet interface instead of MII
        #define _KS8721                                                  // Micrel KS8721BLMM PHY
        #define PHY_ADDRESS_           (0x01)                            // address of PHY on board
        #define PHY_IDENTIFIER         0x00221619                        // MICREL identifier
        #define ETH_TXD_G                                                // locate TXD0 and TXD1 on port G rather than port B
        #define PHY_INTERRUPT                                            // use PHY interrupt
        #define SUPPORT_PORT_INTERRUPTS                                  // support code for port interrupts due to the PHY interrupt
        #define PHY_INT_PORT           PORT_A                            // interrupt on PA3
        #define PHY_INT_PIN            3
        #define PHY_INT_PIN_STATE()    _READ_PORT_MASK(A, PORTA_BIT3)
    #else
        #define _DP83848
        #define PHY_ADDRESS_           0x01                              // address of PHY on STM3210C_EVAL board
        #define ETHERNET_RMII                                            // use RMII Ethernet interface instead of MII
        #define VNDR_MDL               0x09                              // vendor model number
        #define MDL_REV                0x00                              // model revision number
        #define PHY_IDENTIFIER         (0x20005c00 | (VNDR_MDL << 4) | MDL_REV) // NATIONAL DP83848 identifier
        #define PHY_INTERRUPT                                            // use PHY interrupt
        #define PHY_INT_PORT           PORT_C
        #define PHY_INT_PIN            13
        #define PHY_INT_PIN_STATE()    _READ_PORT_MASK(C, PORTC_BIT13)
    #endif

    #define ETHERNET_DRIVE_PHY_25MHZ                                     // set to drive 25MHz from MCO output for use as external PHY clock (saves 25MHz crystal requirement) [used also to specify driving 50MHz clock in RMII mode]
#endif


// Special support for this processor type
//
//#define DMA_MEMCPY_SET                                                 // memcpy and memset functions performed by DMA (if supported by processor - uses one DMA channel)
#define MEMCPY_CHANNEL             1                                     // use channel 1 of DMA controller 1 (avoid using this channel for other DMA purpose)
                                                                         // MEMCPY_CHANNEL > 7 means from DMA controller 2 (eg. MEMCPY_CHANNEL 8 is channel 1 of DMA controller 2)
#define DMA_CNDTR_MEMCPY  DMA1_CNDTR1                                    // define the DMA controller registers to be used
#define DMA_CMAR_MEMCPY   DMA1_CMAR1
#define DMA_CPAR_MEMCPY   DMA1_CPAR1
#define DMA_CCR_MEMCPY    DMA1_CCR1
#define DMA_CNDTR1_MEMCPY DMA1_CNDTR1

// Define interrupt priorities in the system (STM32 support 0..15 - 0 is highest priority and 15 is lowest priority)
//
#define SYSTICK_PRIORITY           15

#define PRIORITY_EXI10_15          8
#define PRIORITY_EXI5_9            8
#define PRIORITY_EXI0              8
#define PRIORITY_EXI1              8
#define PRIORITY_EXI2              8
#define PRIORITY_EXI3              8
#define PRIORITY_EXI4              8
#define PHY_INT_PRIORITY           PRIORITY_EXI10_15
#define PRIORITY_UART5             7
#define PRIORITY_UART4             7
#define PRIORITY_USART6            6
#define PRIORITY_USART1            6
#define PRIORITY_USART2            6
#define PRIORITY_USART3            6
#define PRIORITY_UART7             6
#define PRIORITY_UART8             6
#define PRIORITY_HW_TIMER          5
#define PRIORITY_TIMERS            5
#define PRIORITY_DEVICE_LP_FS      4
#define PRIORITY_USB_OTG           4
#define PRIORITY_I2C1              4
#define PRIORITY_I2C2              4
#define PRIORITY_TWI               4
#define PRIORITY_TICK_TIMER        3
#define PRIORITY_ADC               2
#define PRIORITY_EMAC              1
#define PRIORITY_DEVICE_HP_FS      1
#define PRIORITY_OTG_FS            1


#if !defined GPIO_DEFAULT_INPUT_A
    #define GPIO_DEFAULT_INPUT_A   0xffff                                // initial port input states for simulator
#endif
#if !defined GPIO_DEFAULT_INPUT_B
    #define GPIO_DEFAULT_INPUT_B   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_C
    #define GPIO_DEFAULT_INPUT_C   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_D
    #define GPIO_DEFAULT_INPUT_D   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_E
    #define GPIO_DEFAULT_INPUT_E   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_F
    #define GPIO_DEFAULT_INPUT_F   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_G
    #define GPIO_DEFAULT_INPUT_G   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_H
    #define GPIO_DEFAULT_INPUT_H   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_I
    #define GPIO_DEFAULT_INPUT_I   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_J
    #define GPIO_DEFAULT_INPUT_J   0xffff
#endif
#if !defined GPIO_DEFAULT_INPUT_K
    #define GPIO_DEFAULT_INPUT_K   0xffff
#endif

#endif
